---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.IndexStreamTriangle
source: html/31985fec-4bc6-c088-703e-c7b6791d662d.htm
---
# IndexStreamTriangle Members

Inserts a IndexTriangle into the stream and associated buffer.